simulations/lift-drag/converge/N4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       114280;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       114400;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          640;
        startFace       114520;
    }
    top_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       115160;
    }
    top_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       115560;
    }
    bottom_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       115640;
    }
    bottom_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       116040;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          115200;
        startFace       116120;
    }
)

// ************************************************************************* //
